# Prediction of creditworthiness for credit card applications

In [363]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, OrdinalEncoder

In [364]:
credit_df = pd.read_csv('data/credit_record.csv')
application_df = pd.read_csv('data/application_record.csv')
credit_df.head(30)

         ID  MONTHS_BALANCE STATUS
0   5001711               0      X
1   5001711              -1      0
2   5001711              -2      0
3   5001711              -3      0
4   5001712               0      C
5   5001712              -1      C
6   5001712              -2      C
7   5001712              -3      C
8   5001712              -4      C
9   5001712              -5      C
10  5001712              -6      C
11  5001712              -7      C
12  5001712              -8      C
13  5001712              -9      0
14  5001712             -10      0
15  5001712             -11      0
16  5001712             -12      0
17  5001712             -13      0
18  5001712             -14      0
19  5001712             -15      0
20  5001712             -16      0
21  5001712             -17      0
22  5001712             -18      0
23  5001713               0      X
24  5001713              -1      X
25  5001713              -2      X
26  5001713              -3      X
27  5001713              -4      X
28  5001713              -5      X
29  5001713              -6      X

In [365]:
application_df.head(15)

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
5,5008810,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
6,5008811,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
7,5008812,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0
8,5008813,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0
9,5008814,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0
10,5008815,M,Y,Y,0,270000.0,Working,Higher education,Married,House / apartment,-16872,-769,1,1,1,1,Accountants,2.0
11,5112956,M,Y,Y,0,270000.0,Working,Higher education,Married,House / apartment,-16872,-769,1,1,1,1,Accountants,2.0
12,6153651,M,Y,Y,0,270000.0,Working,Higher education,Married,House / apartment,-16872,-769,1,1,1,1,Accountants,2.0
13,5008819,M,Y,Y,0,135000.0,Commercial associate,Secondary / secondary special,Married,House / apartment,-17778,-1194,1,0,0,0,Laborers,2.0
14,5008820,M,Y,Y,0,135000.0,Commercial associate,Secondary / secondary special,Married,House / apartment,-17778,-1194,1,0,0,0,Laborers,2.0

In [366]:
print(np.isin(credit_df['ID'], application_df['ID']).sum())
print((credit_df['ID'].shape)[0])

777715
1048575

In [367]:
credit_df = credit_df[credit_df['ID'].isin(application_df['ID'])]
credit_df.reset_index(drop=True, inplace=True)
credit_df.head()

        ID  MONTHS_BALANCE STATUS
0  5008804               0      C
1  5008804              -1      C
2  5008804              -2      C
3  5008804              -3      C
4  5008804              -4      C

In [368]:
approved_applications = application_df[np.isin(application_df['ID'], credit_df['ID'])]
approved_applications.reset_index(drop=True, inplace=True)
approved_applications.head(10)

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
5,5008810,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
6,5008811,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
7,5008812,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0
8,5008813,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0
9,5008814,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0

In [369]:
approved_applications.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36457 entries, 0 to 36456
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   36457 non-null  int64
 1   CODE_GENDER          36457 non-null  object
 2   FLAG_OWN_CAR         36457 non-null  object
 3   FLAG_OWN_REALTY      36457 non-null  object
 4   CNT_CHILDREN         36457 non-null  int64
 5   AMT_INCOME_TOTAL     36457 non-null  float64
 6   NAME_INCOME_TYPE     36457 non-null  object
 7   NAME_EDUCATION_TYPE  36457 non-null  object
 8   NAME_FAMILY_STATUS   36457 non-null  object
 9   NAME_HOUSING_TYPE    36457 non-null  object
 10  DAYS_BIRTH           36457 non-null  int64
 11  DAYS_EMPLOYED        36457 non-null  int64
 12  FLAG_MOBIL           36457 non-null  int64
 13  FLAG_WORK_PHONE      36457 non-null  int64
 14  FLAG_PHONE           36457 non-null  int64
 15  FLAG_EMAIL           36457 non-null  int64
 16  OCCUPATION_TYPE      25134 non-null  object
 17  CNT_FAM_MEMBERS      36457 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 5.0+ MB

In [370]:
for column in approved_applications.columns:
    if column == "ID":
        continue
    print("--------------------")
    print(column, approved_applications[column].nunique())
    print(approved_applications[column].value_counts())
    print("--------------------")

--------------------
CODE_GENDER 2
CODE_GENDER
F    24430
M    12027
Name: count, dtype: int64
--------------------
--------------------
FLAG_OWN_CAR 2
FLAG_OWN_CAR
N    22614
Y    13843
Name: count, dtype: int64
--------------------
--------------------
FLAG_OWN_REALTY 2
FLAG_OWN_REALTY
Y    24506
N    11951
Name: count, dtype: int64
--------------------
--------------------
CNT_CHILDREN 9
CNT_CHILDREN
0     25201
1      7492
2      3256
3       419
4        63
5        20
14        3
7         2
19        1
Name: count, dtype: int64
--------------------
--------------------
AMT_INCOME_TOTAL 265
AMT_INCOME_TOTAL
135000.0    4309
180000.0    3097
157500.0    3089
112500.0    2956
225000.0    2926
            ...
177750.0       1
594000.0       1
164250.0       1
124200.0       1
179271.0       1
Name: count, Length: 265, dtype: int64
--------------------
--------------------
NAME_INCOME_TYPE 5
NAME_INCOME_TYPE
Working                 18819
Commercial associate     8490
Pensioner                6152
State servant            2985
Student                    11
Name: count, dtype: int64
--------------------
--------------------
NAME_EDUCATION_TYPE 5
NAME_EDUCATION_TYPE
Secondary / secondary special    24777
Higher education                  9864
Incomplete higher                 1410
Lower secondary                    374
Academic degree                     32
Name: count, dtype: int64
--------------------
--------------------
NAME_FAMILY_STATUS 5
NAME_FAMILY_STATUS
Married                 25048
Single / not married     4829
Civil marriage           2945
Separated                2103
Widow                    1532
Name: count, dtype: int64
--------------------
--------------------
NAME_HOUSING_TYPE 6
NAME_HOUSING_TYPE
House / apartment      32548
With parents            1776
Municipal apartment     1128
Rented apartment         575
Office apartment         262
Co-op apartment          168
Name: count, dtype: int64
--------------------
--------------------
DAYS_BIRTH 7183
DAYS_BIRTH
-12676    54
-15519    54
-16896    38
-14667    37
-15140    32
          ..
-16528     1
-23345     1
-21672     1
-14196     1
-9188      1
Name: count, Length: 7183, dtype: int64
--------------------
--------------------
DAYS_EMPLOYED 3640
DAYS_EMPLOYED
 365243    6135
-401         78
-1539        64
-200         63
-1678        61
           ...
-4686         1
-2160         1
-2007         1
-758          1
-11272        1
Name: count, Length: 3640, dtype: int64
--------------------
--------------------
FLAG_MOBIL 1
FLAG_MOBIL
1    36457
Name: count, dtype: int64
--------------------
--------------------
FLAG_WORK_PHONE 2
FLAG_WORK_PHONE
0    28235
1     8222
Name: count, dtype: int64
--------------------
--------------------
FLAG_PHONE 2
FLAG_PHONE
0    25709
1    10748
Name: count, dtype: int64
--------------------
--------------------
FLAG_EMAIL 2
FLAG_EMAIL
0    33186
1     3271
Name: count, dtype: int64
--------------------
--------------------
OCCUPATION_TYPE 18
OCCUPATION_TYPE
Laborers                 6211
Core staff               3591
Sales staff              3485
Managers                 3012
Drivers                  2138
High skill tech staff    1383
Accountants              1241
Medicine staff           1207
Cooking staff             655
Security staff            592
Cleaning staff            551
Private service staff     344
Low-skill Laborers        175
Waiters/barmen staff      174
Secretaries               151
HR staff                   85
Realty agents              79
IT staff                   60
Name: count, dtype: int64
--------------------
--------------------
CNT_FAM_MEMBERS 10
CNT_FAM_MEMBERS
2.0     19463
1.0      6987
3.0      6421
4.0      3106
5.0       397
6.0        58
7.0        19
15.0        3
9.0         2
20.0        1
Name: count, dtype: int64
--------------------

In [371]:
(approved_applications[(approved_applications['DAYS_EMPLOYED'] > 0) & (approved_applications['NAME_INCOME_TYPE'] == 'Pensioner')].shape)[0]

6135

In [372]:
for column in application_df.columns:
    if column == "ID":
        continue
    print("--------------------")
    print(column, application_df[column].nunique())
    print(application_df[column].value_counts())
    print("--------------------")

--------------------
CODE_GENDER 2
CODE_GENDER
F    294440
M    144117
Name: count, dtype: int64
--------------------
--------------------
FLAG_OWN_CAR 2
FLAG_OWN_CAR
N    275459
Y    163098
Name: count, dtype: int64
--------------------
--------------------
FLAG_OWN_REALTY 2
FLAG_OWN_REALTY
Y    304074
N    134483
Name: count, dtype: int64
--------------------
--------------------
CNT_CHILDREN 12
CNT_CHILDREN
0     304071
1      88527
2      39884
3       5430
4        486
5        133
7          9
9          5
12         4
6          4
14         3
19         1
Name: count, dtype: int64
--------------------
--------------------
AMT_INCOME_TOTAL 866
AMT_INCOME_TOTAL
135000.0    46879
157500.0    39768
180000.0    37912
112500.0    36979
225000.0    34130
            ...
151425.0        1
133461.0        1
265950.0        1
201150.0        1
36679.5         1
Name: count, Length: 866, dtype: int64
--------------------
--------------------
NAME_INCOME_TYPE 5
NAME_INCOME_TYPE
Working                 226104
Commercial associate    100757
Pensioner                75493
State servant            36186
Student                     17
Name: count, dtype: int64
--------------------
--------------------
NAME_EDUCATION_TYPE 5
NAME_EDUCATION_TYPE
Secondary / secondary special    301821
Higher education                 117522
Incomplete higher                 14851
Lower secondary                    4051
Academic degree                     312
Name: count, dtype: int64
--------------------
--------------------
NAME_FAMILY_STATUS 5
NAME_FAMILY_STATUS
Married                 299828
Single / not married     55271
Civil marriage           36532
Separated                27251
Widow                    19675
Name: count, dtype: int64
--------------------
--------------------
NAME_HOUSING_TYPE 6
NAME_HOUSING_TYPE
House / apartment      393831
With parents            19077
Municipal apartment     14214
Rented apartment         5974
Office apartment         3922
Co-op apartment          1539
Name: count, dtype: int64
--------------------
--------------------
DAYS_BIRTH 16379
DAYS_BIRTH
-11707    150
-14178    121
-14400    116
-13482    112
-13274    112
         ...
-8207       1
-8286       1
-12793      1
-24592      1
-8590       1
Name: count, Length: 16379, dtype: int64
--------------------
--------------------
DAYS_EMPLOYED 9406
DAYS_EMPLOYED
 365243    75329
-218         262
-1678        251
-249         241
-978         240
           ...
-13529         1
-10223         1
-8917          1
-11429         1
-8105          1
Name: count, Length: 9406, dtype: int64
--------------------
--------------------
FLAG_MOBIL 1
FLAG_MOBIL
1    438557
Name: count, dtype: int64
--------------------
--------------------
FLAG_WORK_PHONE 2
FLAG_WORK_PHONE
0    348156
1     90401
Name: count, dtype: int64
--------------------
--------------------
FLAG_PHONE 2
FLAG_PHONE
0    312353
1    126204
Name: count, dtype: int64
--------------------
--------------------
FLAG_EMAIL 2
FLAG_EMAIL
0    391102
1     47455
Name: count, dtype: int64
--------------------
--------------------
OCCUPATION_TYPE 18
OCCUPATION_TYPE
Laborers                 78240
Core staff               43007
Sales staff              41098
Managers                 35487
Drivers                  26090
High skill tech staff    17289
Accountants              15985
Medicine staff           13520
Cooking staff             8076
Security staff            7993
Cleaning staff            5845
Private service staff     3456
Low-skill Laborers        2140
Secretaries               2044
Waiters/barmen staff      1665
Realty agents             1041
HR staff                   774
IT staff                   604
Name: count, dtype: int64
--------------------
--------------------
CNT_FAM_MEMBERS 13
CNT_FAM_MEMBERS
2.0     233891
1.0      84492
3.0      77128
4.0      37356
5.0       5081
6.0        459
7.0        124
9.0          9
11.0         5
14.0         4
8.0          4
15.0         3
20.0         1
Name: count, dtype: int64
--------------------

In [373]:
(application_df[(application_df['DAYS_EMPLOYED'] > 0) & (application_df['NAME_INCOME_TYPE'] == 'Pensioner')].shape)[0]

75329

In [374]:
print(application_df[application_df['DAYS_EMPLOYED'] == 0].shape[0])
print(approved_applications[approved_applications['DAYS_EMPLOYED'] == 0].shape[0])

0
0

In [375]:
def rename_columns(df, column_name, new_column_name):
    df.rename(columns={column_name: new_column_name}, inplace=True)
    return df

In [376]:
def encode_dataframe_columns(data_train, data_test, encoder, columns_list):
    for column in columns_list:
            data_train[column] = encoder.fit_transform(data_train[column])
            data_test[column] = encoder.transform(data_test[column])
    return data_train, data_test

In [377]:
# iDEA: analizzo il dataset di quelli che hanno ricevuto la carta di credito. In base a questi campioni, mi faccio "un'idea" di come dovrebbe essere un cliente che 
# riceve la carta di credito. Poi, analizzo il dataset di tutti i clienti e vedo se ci sono delle differenze significative. 
# Se ci sono, allora posso dire che ci sono delle caratteristiche che influenzano il fatto di ricevere la carta di credito o meno.
# Inoltre posso valutare tra i clienti che hanno ricevuto la carta, quelli che sono affidabili e quelli che non lo sono.

In [378]:
def preprocess_dataframe(data):
    data.loc[:, 'DAYS_BIRTH'] = data['DAYS_BIRTH'].map(lambda x: int(-x / 365) if x < 0 else 0)
    data.loc[:, 'DAYS_EMPLOYED'] = data['DAYS_EMPLOYED'].map(lambda x: int(-x / 365) if x < 0 else 0) 
    data = rename_columns(data, 'DAYS_BIRTH', 'AGE')
    data = rename_columns(data, 'DAYS_EMPLOYED', 'YEARS_EMPLOYED')
    data = data.drop(columns=["CODE_GENDER", "CNT_CHILDREN"])
    data.loc[:, "AVAILABILITY"] = (data["FLAG_MOBIL"] + data["FLAG_WORK_PHONE"] + data["FLAG_PHONE"] + data["FLAG_EMAIL"])/4
    data = data.drop(columns=["FLAG_MOBIL", "FLAG_WORK_PHONE", "FLAG_PHONE", "FLAG_EMAIL"])

    marriage_mapper = {"Single / not married": 0, "Married": 1, "Civil marriage": 1, "Separated": 2, "Widow": 3}
    data.loc[:, "NAME_FAMILY_STATUS"] = data["NAME_FAMILY_STATUS"].map(marriage_mapper)

    return data

In [379]:
approved_applications = preprocess_dataframe(approved_applications)

/tmp/ipykernel_7594/198459180.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.rename(columns={column_name: new_column_name}, inplace=True)

In [380]:
approved_applications.head()

,ID,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,AGE,YEARS_EMPLOYED,OCCUPATION_TYPE,CNT_FAM_MEMBERS,AVAILABILITY
0,5008804,Y,Y,427500.0,Working,Higher education,1,Rented apartment,32,12,NaN,2.0,0.50
1,5008805,Y,Y,427500.0,Working,Higher education,1,Rented apartment,32,12,NaN,2.0,0.50
2,5008806,Y,Y,112500.0,Working,Secondary / secondary special,1,House / apartment,58,3,Security staff,2.0,0.25
3,5008808,N,Y,270000.0,Commercial associate,Secondary / secondary special,0,House / apartment,52,8,Sales staff,1.0,0.75
4,5008809,N,Y,270000.0,Commercial associate,Secondary / secondary special,0,House / apartment,52,8,Sales staff,1.0,0.75

In [338]:
print("Unique ID : ", credit_df['ID'].nunique())
print(credit_df['MONTHS_BALANCE'].value_counts())
credit_df[credit_df['ID'] == 5008809]

Unique ID :  36457
MONTHS_BALANCE
-1     24963
-2     24871
 0     24672
-3     24644
-4     24274
       ...
-56     1588
-57     1253
-58      955
-59      627
-60      321
Name: count, Length: 61, dtype: int64

         ID  MONTHS_BALANCE STATUS
66  5008809             -22      X
67  5008809             -23      X
68  5008809             -24      X
69  5008809             -25      X
70  5008809             -26      X

In [383]:
round(approved_applications[["AMT_INCOME_TOTAL", "AGE", "YEARS_EMPLOYED", "CNT_FAM_MEMBERS", "AVAILABILITY"]].describe(), 2)

,AMT_INCOME_TOTAL,AGE,YEARS_EMPLOYED,CNT_FAM_MEMBERS,AVAILABILITY
count,36457.00,36457.00,36457.00,36457.00,36457.00
mean,186685.74,43.26,5.61,2.20,0.40
std,101789.23,11.51,6.42,0.91,0.19
min,27000.00,20.00,0.00,1.00,0.25
25%,121500.00,34.00,1.00,2.00,0.25
50%,157500.00,42.00,4.00,2.00,0.25
75%,225000.00,53.00,8.00,3.00,0.50
max,1575000.00,68.00,43.00,20.00,1.00

In [339]:
class Client:
    def __init__(self, id, info, credit_info):
        self.id = id
        self._info = info
        self._credit_info = credit_info
        self.status = credit_info['STATUS'].value_counts()
        self.history = credit_info.shape[0]
        self.pay_stats = {'0':0, '1':0, '2':0, '3':0, '4':0, '5':0, 'C':0, 'X':0}
        self._get_pay_stats()
        self.reliability = 0
        self._reliability_setted = False
        
    def __str__(self):
        return "ID: " + str(self.id) + " Status: " + str(self.status) + " history: " + str(self.history) + " History Status Reliability: " + str(self.get_history_reliability) + " Last Period Status Reliability: " + str(self.get_last_period_status_reliability)
    
    def __repr__(self):
        return "ID: " + str(self.id) + " Status: " + str(self.status) + " history: " + str(self.history) + " History Status Reliability: " + str(self.get_history_reliability) + " Last Period Status Reliability: " + str(self.get_last_period_status_reliability)
    
    def _get_pay_stats(self):
        for k in self.status.keys():
            if(k in self.status.index):
                self.pay_stats[k] = self.status[k]/self.history

    def get_history_reliability(self):        
        if self.pay_stats['5'] > 0.40:
            return 0
        elif self.pay_stats['5'] > 0.25 or self.pay_stats['4'] > 0.40:
            return 1
        elif self.pay_stats['4'] > 0.25 or self.pay_stats['3'] > 0.40:
            return 2
        elif self.pay_stats['3'] > 0.25 or self.pay_stats['2'] > 0.40:
            return 3
        elif self.pay_stats['2'] > 0.25 or self.pay_stats['1'] > 0.40:
            return 4
        elif self.pay_stats['1'] > 0.25 or self.pay_stats['0'] > 0.40:
            return 5
        elif self.pay_stats['0'] > 0.25 or self.pay_stats['C'] < 0.65:
            return 6
        return 7

    def get_last_period_reliability(self):
        last_period_check = 5 if self.history > 12 else int(self.history/2)
        reliability = 7
        i = 0
        for _, row in self._credit_info.iterrows():
            if i == last_period_check:
                break
            if row['STATUS'] == '5':
                reliability = int(reliability*0.2) 
            elif row['STATUS'] == '4': 
                reliability = int(reliability*0.35)
            elif row['STATUS'] == '3':
                reliability = int(reliability*0.5)
            elif row['STATUS'] == '2':
                reliability = int(reliability*0.65)
            elif row['STATUS'] == '1':
                reliability = int(reliability*0.80)
            elif row['STATUS'] == '0':
                reliability = 6
            elif row['STATUS'] == 'C' or row['STATUS'] == 'X':
                reliability = 7
            i+=1
        return reliability

    def get_status_reliability(self):
        reliability = 7
        if self._info["NAME_INCOME_TYPE"] == "Student":
            return 0

        if ( ( self._info["AGE"] >= 35 and self._info["YEARS_EMPLOYED"] >= 10 ) or
             ( self._info["NAME_INCOME_TYPE"] == "Pensioner" ) 
           ) and
             (self._info["CNT_FAM_MEMBERS"] <= 5 ) and 
             (self._info["AVAILABILITY"] >= 0.75):
            if self._info["AMT_INCOME_TOTAL"] >= self._info["AMT_INCOME_TOTAL"].quantile(0.75):
                return 7
            else:
                reliability = 6
        elif self._info["AMT_INCOME_TOTAL"] >= self._info["AMT_INCOME_TOTAL"].quantile(0.50):
            if ( 
                ( self._info["AGE"] >= 35 and self._info["YEARS_EMPLOYED"] >= 10 ) or
                ( self._info["NAME_INCOME_TYPE"] == "Pensioner" ) 
               ) and
               (self._info["CNT_FAM_MEMBERS"] <= 5 ) and 
               (self._info["AVAILABILITY"] >= 0.75):
                return 5
            else:
                reliability = 4
        elif self._info["AMT_INCOME_TOTAL"] >= self._info["AMT_INCOME_TOTAL"].quantile(0.25):



        if self._info["AMT_INCOME_TOTAL"] < self._info["AMT_INCOME_TOTAL"].quantile(0.25):
            reliability = int(reliability*0.25)
        elif self._info["AMT_INCOME_TOTAL"] < self._info["AMT_INCOME_TOTAL"].quantile(0.50):
            reliability = int(reliability*0.50)
        elif self._info["AMT_INCOME_TOTAL"] < self._info["AMT_INCOME_TOTAL"].quantile(0.75):
            reliability = int(reliability*0.75)
        if self._info["AGE"] < 35:
            reliability = int(reliability*0.35)
        elif self._info["AGE"] > 60:
            reliability = int(reliability*0.65)
        if self._info["YEARS_EMPLOYED"] < 1 and self._info["NAME_INCOME_TYPE"] != "Pensioner":
            reliability = int(reliability*0.35)
        elif self._info["YEARS_EMPLOYED"] < 5:
            reliability = int(reliability*0.5)
        
        
    def set_reliability(self):
        self.reliability = int((self.get_history_reliability() * 0.65 + self.get_last_period_reliability() * 0.35))
        self._reliability_setted = True

    def get_reliability(self):
        if not self._reliability_setted:
            self.set_reliability()
        return self.reliability
    
    def get_client_status(self):
        return self.status
    
    def get_client_history(self):
        return self.history
    
    def get_client_id(self):
        return self.id

In [340]:
ids = approved_applications['ID'].unique()
clients_reliability = { "CLIENT_RELIABILITY": []}

client=Client(ids[0], approved_applications[(approved_applications['ID'] == ids[0]).drop(columns=['ID'])], credit_df[(credit_df['ID'] == ids[0]).drop(columns=['ID'])])

#for id in ids:
#    client=Client(id, approved_applications[(approved_applications['ID'] == id).drop(columns=['ID'])], credit_df[(credit_df['ID'] == id).drop(columns=['ID'])])
#    clients_reliability["CLIENT_RELIABILITY"].append(client.get_reliability())

approved_applications = approved_applications.join(pd.DataFrame(clients_reliability))

In [243]:
credit_df[credit_df['ID'] == 5135344].head(10)

             ID  MONTHS_BALANCE STATUS
671459  5135344               0      5
671460  5135344              -1      5
671461  5135344              -2      5
671462  5135344              -3      5
671463  5135344              -4      5
671464  5135344              -5      5
671465  5135344              -6      5
671466  5135344              -7      5
671467  5135344              -8      5
671468  5135344              -9      5

In [244]:
approved_applications[approved_applications['ID'] == 5135344]

,ID,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,AGE,YEARS_EMPLOYED,OCCUPATION_TYPE,CNT_FAM_MEMBERS,AVAILABILITY,CLIENT_RELIABILITY
31722,5135344,N,Y,112500.0,Commercial associate,Higher education,1,House / apartment,55,1,Security staff,2.0,0.25,0

In [245]:
approved_applications['AGE'].value_counts()

AGE
37    1207
27    1129
28    1126
40    1125
39    1105
34    1057
33    1054
38    1047
32    1041
41    1040
42    1035
35    1013
43    1003
30    1002
36     966
31     944
44     930
29     929
46     893
47     890
51     889
48     871
54     845
50     844
57     833
56     813
59     809
60     803
45     779
53     765
58     752
52     746
49     746
55     656
62     634
64     547
63     544
61     538
26     517
25     489
24     368
65     339
66     268
23     213
22     146
67     120
68      36
21      10
20       1
Name: count, dtype: int64

In [246]:
from sklearn.model_selection import train_test_split
from sklearn.compose import ColumnTransformer

RANDOM_STATE = 7
columns_to_encode = ["FLAG_OWN_CAR", "FLAG_OWN_REALTY", "NAME_INCOME_TYPE", "NAME_EDUCATION_TYPE", "NAME_HOUSING_TYPE"]

columns_to_not_encode = ["AMT_INCOME_TOTAL", "NAME_FAMILY_STATUS", "AGE", "YEARS_EMPLOYED", "OCCUPATION_TYPE", "CNT_FAM_MEMBERS", "AVAILABILITY"]

X = approved_applications.drop(columns=['ID', 'CLIENT_RELIABILITY'])
y = approved_applications['CLIENT_RELIABILITY']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=RANDOM_STATE)

oe = OrdinalEncoder(encoded_missing_value = -1, handle_unknown = 'use_encoded_value', unknown_value = -2)
column_transformer = ColumnTransformer([('encoder', OrdinalEncoder(), columns_to_encode)], remainder='passthrough')
X_train["OCCUPATION_TYPE"] = oe.fit_transform(X_train["OCCUPATION_TYPE"].values.reshape(-1, 1))
X_train = column_transformer.fit_transform(X_train)
X_test["OCCUPATION_TYPE"] = oe.transform(X_test["OCCUPATION_TYPE"].values.reshape(-1, 1))
X_test = column_transformer.transform(X_test)

In [247]:
X_train = pd.DataFrame(X_train, columns=columns_to_encode + columns_to_not_encode)
X_test = pd.DataFrame(X_test, columns=columns_to_encode + columns_to_not_encode)

In [254]:
X_train.head(10)

,FLAG_OWN_CAR,FLAG_OWN_REALTY,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,AMT_INCOME_TOTAL,NAME_FAMILY_STATUS,AGE,YEARS_EMPLOYED,OCCUPATION_TYPE,CNT_FAM_MEMBERS,AVAILABILITY
0,0,1,1,4,1,112500,3,63,0,-1,1,0
1,0,0,4,4,1,180000,0,25,4,-1,1,0
2,0,0,0,4,1,99000,1,27,1,8,2,0
3,0,0,4,4,1,67500,1,45,19,8,3,0
4,1,1,4,1,1,225000,1,47,8,3,2,0
5,0,1,4,4,1,157500,0,23,4,3,1,0
6,0,0,1,4,1,89550,0,64,0,-1,1,0
7,0,1,4,4,1,103500,1,61,35,10,2,0
8,0,1,4,2,1,202500,0,50,19,3,1,0
9,0,1,1,4,1,79650,1,44,0,-1,2,0

In [250]:
#X_train.fillna(-1, inplace=True)
X_train = X_train.astype('int64')
#X_test.fillna(-1, inplace=True)
X_test = X_test.astype('int64')

print(y_train.value_counts())

CLIENT_RELIABILITY
5    14927
6     7795
7     6017
4      282
3       83
0       43
2       16
1        2
Name: count, dtype: int64

In [251]:
if 0:
    import gap_statistic as gs
    X_train_cat = X_train.drop(columns=['AMT_INCOME_TOTAL', 'DAYS_BIRTH', 'DAYS_EMPLOYED'])
    optimalK = gs.OptimalK(parallel_backend='multiprocessing')
    optimalK(X_train_cat, cluster_array=np.arange(3, 10))

    from kmodes.kmodes import KModes
    from kmodes.kprototypes import KPrototypes

    km = KModes(n_clusters=7, init='Huang', n_init=5, verbose=1)
    clusters = km.fit_predict(X_train_cat)
    print(km.cluster_centroids_)
    print(km.labels_)

In [252]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
X_train_std = scaler.fit_transform(X_train)
X_test_std = scaler.transform(X_test)

In [253]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score

clf = RandomForestClassifier(n_estimators=100, random_state=RANDOM_STATE, class_weight='balanced')
clf.fit(X_train_std, y_train)
y_pred = clf.predict(X_test_std)
accuracy_score(y_test, y_pred)

0.5230389467910038

In [166]:
from sklearn.multiclass import OneVsRestClassifier
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score

clf = OneVsRestClassifier(SVC()).fit(X_train_std, y_train)
y_pred = clf.predict(X_test_std)
accuracy_score(y_test, y_pred)

0.5152221612726275

In [167]:
from sklearn.preprocessing import MinMaxScaler

norm = MinMaxScaler()
X_train_norm = norm.fit_transform(X_train)
X_test_norm = norm.transform(X_test)

from sklearn.neural_network import MLPClassifier
from sklearn.metrics import accuracy_score

clf = MLPClassifier(hidden_layer_sizes=(25, 50, 50), max_iter=1000, random_state=RANDOM_STATE)
clf.fit(X_train_norm, y_train)
y_pred = clf.predict(X_test_norm)
accuracy_score(y_test, y_pred)

/home/enrmic/.local/lib/python3.10/site-packages/sklearn/neural_network/_multilayer_perceptron.py:698: UserWarning: Training interrupted by user.
  warnings.warn("Training interrupted by user.")

0.5082281952825014